---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsSpacingChanged
source: html/a0777387-3afd-8563-8787-df3b09f68b8f.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsSpacingChanged Property

Indicates if the spacing has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsSpacingChanged { get; }
```